In [22]:
import pandas as pd
import numpy as np

In [23]:
df=pd.read_csv("Data[1].csv")

In [24]:
df.head(5)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [25]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [26]:
print("\nmissing value in each column :\n",df.isnull().sum())

missing value in each column :
 Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [27]:
df_drop = df.dropna()
print("\ndataset after dropping missing roes:\n",df_drop.head())

dataset after dropping missing roes:
    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes

In [28]:
df_drop_col = df.dropna(axis=1)
print("\ndataset after dropping column with missing value :\n", df_drop_col.head())

dataset after dropping column with missing value :
    Country Purchased
0   France        No
1    Spain       Yes
2  Germany        No
3    Spain        No
4  Germany       Yes

In [29]:
df_fill_mean=df.fillna(df.mean(numeric_only=True))
print("\ndataset after filling numeric missing value with mean:\n",df_fill_mean.head())

dataset after filling numeric missing value with mean:
    Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes

In [30]:
df_fill_forward = df.fillna(method="ffill")
print("\ndataset after forward fill:\n",df_fill_forward.head())

dataset after forward fill:
    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  61000.0       Yes

In [35]:
df_fill_backward = df.fillna(method="bfill")
print("\ndataset after backward fill:\n",df_fill_backward.head())

dataset after backward fill:
    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  58000.0       Yes

In [32]:
df_fill_backword

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [33]:
df.loc[4]

Country      Germany
Age             40.0
Salary           NaN
Purchased        Yes
Name: 4, dtype: object